# GetMesh Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MeshFromGeometryOperationResult..::..GetMesh Method
MeshFromGeometryOperationResult Class See Also
---
This returns a valid mesh only for the first call. Later calls will throw an exception as the mesh is no longer valid in this object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Mesh GetMesh()
```

Visual Basic
---
```text
Public Function GetMesh As Mesh
```

Visual C++
---
```text
public:
Mesh^ GetMesh()
```

# ### Return Value
Mesh which built.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The Mesh has already been accessed by a previous GetMesh() call, and is no longer available for use. |

# See Also
MeshFromGeometryOperationResult Class
Autodesk.Revit.DB Namespace